{"Disco Elysium: The Final Cut": ["MAR 30, 2021", "Disco Elysium - The Final Cut is the definitive edition of the smash-hit RPG. Pursue your political dreams in new quests, meet and question more of the city's locals, and explore a whole extra area. Full voice-acting, controller support, and expanded language options also included. Get even more out of this award-winning open world. You're a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders, or take bribes. Become a hero or an absolute disaster of a human being.", "97"], "Half-Life 2": ["NOV 16, 2004", "[Metacritic's 2004 PC Game of the Year] By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment to the behaviors -- even the emotions -- of both friends and enemies. The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people -- people he cares about -- are counting on him. [Vivendi Universal]", "96"], "Grand Theft Auto V": ["APR 13, 2015  • ", "Los Santos is a vast, sun-soaked metropolis full of self-help gurus, starlets and once-important, formerly-known-as celebrities. The city was once the envy of the Western world, but is now struggling to stay afloat in an era of economic uncertainty and reality TV. Amidst the chaos, three unique criminals plot their own chances of survival and success: Franklin, a former street gangster in search of real opportunities and serious cheddar; Michael, a professional ex-con whose retirement is a lot less rosy than he hoped it would be; and Trevor, a violent maniac driven by the chance of a cheap high and the next big score. Quickly running out of options, the crew risks it all in a sequence of daring and dangerous heists that could set them up for life.", "96"], "Baldur's Gate 3": ["AUG 3, 2023", "An ancient evil has returned to Baldur's Gate, intent on devouring it from the inside out. The fate of Faerun lies in your hands. Alone, you may resist. But together, you can overcome. Gather your party and return to the Forgotten Realms in a tale of fellowship and betrayal, sacrifice and survival, and the lure of absolute power. Mysterious abilities are awakening inside you, drawn from a mind flayer parasite planted in your brain. Resist, and turn darkness against itself. Or embrace corruption, and become ultimate evil.", "96"], "The Orange Box": ["OCT 10, 2007", "Games included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people - people he cares about - are counting on him. Half-Life 2: Episode One - The player reprises his role of Dr. Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces. Half-Life 2: Episode Two -- the second installment in Valve's episodic trilogy advances the award-winning story, leading the player to new locations outside of City 17. Portal - a pioneering type of single player action game that rewrites the rules for how players approach and manipulate their environment – much like how Half-Life 2's Gravity Gun reinvented the way gamers interact with objects in the game. Team Fortress 2 - an all-new version of the legendary title that spawned team based multiplayer action games. The game's daring new art style features the most advanced graphics of any Source-based game released to date. [Valve Software]", "96"], "Half-Life": ["NOV 19, 1998", "Half-Life combines great storytelling in the tradition of Stephen King with intense action and advanced technology to create a frighteningly realistic world where players need to think smart to survive. Half-Life has won more than 50 Game of the Year awards from publications around the world, and was named 'Best PC Game Ever' in PC Gamer's November 1999 issue. [Sierra]", "96"], "No cargado.": ["AUG 12, 2002", "Take Your Game Online: Access an online community where you can meet, chat, and play head-to-head against other gamers. Audio Dream Team: Dynamic play-by-play and analysis by Madden and Michaels. All-New Mini-camp: Hop on John Madden's Cruiser Tour Bus and travel to all NFL cities to complete skilled tasks. Create-A-Playbook: Customize receiver routes, player formations, and your team's entire playbook. Deepest Franchise Mode Ever: Play 30 years of Franchise mode and draft players each season with tips from your scouts. [EA Sports]", "89"], "Baldur's Gate II: Shadows of Amn": ["SEP 24, 2000", "An epic continuation of the story that began in \"Baldur's Gate,\" this RPG is set along the southern portion of the Sword Coast, a detailed and rich area of the Forgotten Realms called Amn. It features 300 spells and 130-plus monster types compared to only 130 spells and 60 monster types in Baldur's Gate. [Interplay]", "95"], "Persona 5 Royal": ["OCT 21, 2022", "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.", "95"], "Portal 2": ["APR 18, 2011  • ", "Valve is working on a full-length sequel to its award-winning, mind-bending puzzle action game for the Xbox 360 and PC.", "95"], "The Elder Scrolls V: Skyrim": ["NOV 10, 2011  • ", "The next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before. Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons. Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions. Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself.", "94"], "Mass Effect 2": ["JAN 26, 2010", "The Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make their mark on the galactic stage, are now faced with an even greater peril. [BioWare]", "94"], "Grand Theft Auto: Vice City": ["MAY 12, 2003", "[Metacritic's 2002 PS2 Game of the Year ] Welcome to Vice City. Welcome to the 1980s. Having just made it back onto the streets of Liberty City after a long stretch in maximum security, Tommy Vercetti is sent to Vice City by his old boss, Sonny Forelli. They were understandably nervous about his re-appearance in Liberty City, so a trip down south seemed like a good idea. But all does not go smoothly upon his arrival in the glamorous, hedonistic metropolis of Vice City. He's set up and is left with no money and no merchandise. Sonny wants his money back, but the biker gangs, Cuban gangsters, and corrupt politicians stand in his way. Most of Vice City seems to want Tommy dead. His only answer is to fight back and take over the city himself. Vice City offers vehicular pleasures to suit every taste. For the speed enthusiast, there's high-performance cars and motorbikes. For the sportsman, a powerboat or a golf buggy lets you enjoy the great outdoors. For those that need that sense of freedom and escape, why not charter a helicopter and see the beauty of Vice City from the air? [Rockstar]", "94"], "Sid Meier's Civilization II": ["FEB 29, 1996", "An empire-building turn-based strategy game. The game starts at the Old Stone Age in 4000 BC. Your tribe begins with a Settlers unit and has no knowledge about the surrounding area. As you found new cities and explore the surroundings, you may find hostile barbarians, villages, and other competing cultures. [Civ Fantatics' Center]", "94"], "Quake": ["JUN 22, 1996", "Rage through 32 single player levels and 6 deathmatch levels of sheer terror and fully immersive sound and lighting. Arm yourself against the cannibalistic Ogre, fiendish Vore and indestructible Schambler using letal nails, fierce Thunderbolts and abominable Rocket and Grenade Launchers. [id Software]", "94"], "The Elder Scrolls IV: Oblivion": ["MAR 20, 2006", "Oblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (the equivalent of hell in the world of Tamriel) open, and demons begin to invade Cyrodiil and attack its people and towns. It's up to you to find the lost heir to the throne and unravel the sinister plot that threatens to destroy all of Tamriel. In keeping with the Elder Scrolls tradition, players have the option to experience the main quest at their own pace, and there are plenty of opportunities to explore the vast world and make your own way. Numerous factions can be joined, such as the thieves or mages guilds, and each contains its own complete storyline and the chance to rise to the head of the faction and reap further rewards. Oblivion features a groundbreaking new AI system, called Radiant AI, which gives non-player characters (NPCs) the ability to make their own choices based on the world around them. They decide where to eat or who to talk to and what they say. They sleep, go to church, and even steal items, all based on their individual characteristics. Full facial animations and lip-synching, combined with full speech for all dialog, allows NPCs to come to life like never before. [Bethesda]", "94"], "Elden Ring": ["FEB 25, 2022", "A New World Created By Hidetaka Miyazaki And George R. R. Martin. ELDEN RING, developed by FromSoftware, Inc. and BANDAI NAMCO Entertainment Inc., is a fantasy action-RPG adventure set within a world created by Hidetaka Miyazaki creator of the influential DARK SOULS video game series; and George R.R. Martin author of The New York Times best-selling fantasy series, A Song of Ice and Fire. Danger and discovery lurk around every corner in FromSoftware's largest game to-date. Hidetaka Miyazaki, President and Game Director of FromSoftware Inc. Known for directing critically-acclaimed games in beloved franchises including Armored Core, Dark Souls, and Sekiro: Shadows Die Twice. George R.R. Martin is the #1 New York Times bestselling author of many novels, including the acclaimed series A Song of Ice and Fire - A Game of Thrones, A Clash of Kings, A Storm of Swords, A Feast For Crows, and A Dance with Dragons. As a writer-producer, he has worked on The Twilight Zone, Beauty and the Beast, and various feature films and pilots that were never made.", "94"], "Grim Fandango": ["OCT 14, 1998", "Something's rotten in the Land of Dead and you're being played for a sucker. Meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their four-year journey to eternal rest. But there's trouble in paradise. Help Manny untangle himself from a conspiracy that threatens his very salvation. [LucasArts]", "94"], "Diablo": ["DEC 31, 1996", "The kingdom of Khandaras has fallen into chaos. An unknown force of evil has swept across the land. Plunging it nto civil war and terrorizing the populace. A mad king, his missing son, and a mysterious archbishop are all pieces to the puzzle that faces you. You have journeyed to the source of the evil. The town of Tristram. Now inhabited by only a handful of survivors. The catherdal there is buildt over the ruins of an ancient monastary, and now eerie lights and sounds are heard echoing through its abandoned halls. Perhaps the answer lies withing the remains of a forgotten past... Diablo invites you to enter a world of dark gothic fantasy. Play as a brave warrior, cunning rogue or mysterious sorceror. As you venture deeper into the labyrinth, you'll discover weapons, armor, and magical treasures, and develop your character's skills and abilities. [Blizzard]", "94"], "Sid Meier's Civilization IV": ["OCT 25, 2005", "Faster-Paced Fun - Gameplay has been streamlined for a tighter, faster, and more compelling experience.Greater Accessibility and Ease of Play - An easy-to-use interface will be immediately familiar to RTS and action game players, and newcomers to the series will be able to jump in and play. Tech Tree - Flexible Tech tree allows players more strategic choices for developing their civilizations along unique paths. More Civs, Units, and Improvements to enhance and grow your empire. Multiplayer -LAN, Internet, PBEM, and Persistent Turn-Based Server (PTBS) offer players all-new strategies and ways to play when competing or cooperating with live opponents. Team Play - Whether playing multiplayer or single player, team play offers a new way of setting locked alliances that result in shared wonder effects, visibility, unit trading, and shared territory that delivers a plethora of new strategic and tactical options. Civ IV comes to life! - Beautiful 3D world with dozens of fully animated units (including culturally unique units), and totally customizable armies. Cities and wonders will appear on the map. Wonder movies are back! [2K Games]", "94"], "The Witcher 3: Wild Hunt": ["MAY 18, 2015", "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders, breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format.", "93"], "Dwarf Fortress": ["AUG 8, 2006", "The deepest, most intricate simulation of a world that's ever been created. The legendary Dwarf Fortress is now on Steam. Build a fortress and try to help your dwarves survive against a deeply generated world.", "93"], "Half-Life: Alyx": ["MAR 23, 2020", "Half-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine's control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth's greatest scientists: you and your father, Dr. Eli Vance. As founders of a fledgling resistance, you've continued your clandestine scientific activityperforming critical research, and building invaluable tools for the few humans brave enough to defy the Combine. Every day, you learn more about your enemy, and every day you work toward finding a weakness. ABOUT GAMEPLAY IN VR: Valve's return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life. Immerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat. Lean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier. Extra content for Index owners Customers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year: * Explore environments from Half-Life: Alyx in your SteamVR Home space * Alternate gun skins to embellish Alyx's arsenal * Special Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2 Community-built environments * A set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve's level authoring tool, has been updated with all of the game's virtual reality gameplay tools and components.", "93"], "Unreal Tournament 2004": ["MAR 16, 2004", "Reload, rev up and ride out. The new Tournament is faster, higher and meaner. Land and air based vehicles take combat to a new level; while an arsenal of new weaponry, daunting arenas and battlefields and the challenge of the Assault and Onslaught modes make the gladiator blood sport of the future a brand new experience. Buckle up; it?s gonna be one hell of a ride! [Atari]", "93"], "God of War": ["JAN 14, 2022", "His vengeance against the gods of Olympus far behind him, Kratos now lives as a man in the lands of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same. As mentor and protector to a son determined to earn his respect, Kratos is faced with an unexpected opportunity to master the rage that has long defined him. Questioning the dark lineage he’s passed on to his son, he hopes to make amends for the shortcomings of his past. Set within the untamed forests, mountains, and realms of Norse lore, God of War features a distinctly new setting with its own pantheon of creatures, monsters, and gods. [Playstation.com]", "93"], "Red Dead Redemption 2": ["NOV 5, 2019  • ", "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]", "93"], "Grand Theft Auto III": ["MAY 20, 2002", "The PC version features enhanced 3D audio. Environmentally scaled and referenced from the player's perspective. Create your own customizable Liberty City radio station, using the built-in mp3 player. State-of-the art visuals utilizing the latest PC hardware render the city more beautifully than ever in 32 bit color. The skinnable player character enables fans to create and upload their own skin textures and to use a scanned-in photo to play as themselves. [Rockstar]", "93"], "Beat Saber": ["MAY 1, 2018", "Beat Saber is a VR rhythm game where your goal is to slash the beats which perfectly fit into precisely handcrafted music.", "93"], "Hades": ["DEC 6, 2018  • ", "Defy the god of death as you hack and slash your way out of the Underworld in this rogue-like dungeon crawler from the creators of Bastion and Transistor.", "93"], "Star Wars: Knights of the Old Republic": ["NOV 18, 2003", "Engage in this saga set in the Golden Age of the Republic - over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands. With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on. Your actions determine the outcome of this colossal galactic war - and your destiny as a Jedi. [LucasArts]", "93"], "World of Warcraft": ["NOV 23, 2004", "Four years have passed since the aftermath of Warcraft III: Reign of Chaos, and a great tension now smolders throughout the ravaged world of Azeroth. As the battle-worn races begin to rebuild their shattered kingdoms, new threats, both ancient and ominous, arise to plague the world once again. World of Warcraft is an online role-playing experience set in the award-winning Warcraft universe. Players assume the roles of Warcraft heroes as they explore, adventure, and quest across a vast world. Being \"Massively Multiplayer,\" World of Warcraft allows thousands of players to interact within the same world. Whether adventuring together or fighting against each other in epic battles, players will form friendships, forge alliances, and compete with enemies for power and glory. A dedicated live team will create a constant stream of new adventures to undertake, lands to explore, and monsters to vanquish. This content ensures that the game will never be the same from month to month, and will continue to offer new challenges and adventures for years to come. [Blizzard Entertainment]", "93"], "Grand Theft Auto: San Andreas": ["JUN 7, 2005  • ", "Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets. [Rockstar]", "93"], "Call of Duty 4: Modern Warfare": ["NOV 5, 2007", "As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, under concealment, in a Ghillie suit miles behind enemy lines, the next you are engaging hostiles from an AC-130 gunship thousands of feet above the battlefield. Mixed with explosive action, Call of Duty 4: Modern Warfare also delivers special effects, including use of depth of field, rim-lighting, character self-shadowing, real time post-processing, texture streaming as well as physics-enabled effects. Infinity Ward deployed a dedicated team from the start to deliver a new level of depth to multiplayer. Building on the hit \"Call of Duty 2\" online experience, Call of Duty 4: Modern Warfare's new multiplayer provides the community an addictive and accessible experience to gamers of all levels. [Activision]", "92"], "The Sims": ["FEB 4, 2000  • ", "In \"SimCity,\" you had the power to build and control cities ... with The Sims, you'll create and control people!", "92"], "Sid Meier's Gettysburg!": ["SEP 30, 1997  • ", "Experience victory in Sid Meier's Gettysburg! It's the most engrossing and sophisticated real-time strategy game ever. In a stunning 3D battlefield, you plan the tactics, lead the troops, and take history into your own hands. Attack from the trees to protect your brigade,rally around a General for a quicker recovery, entrench your troops as your cannons blast the hillside, and much, much more with just a click of the mouse! Complete multiplayer support via internet, LAN, modem and serial link. [Firaxis]", "92"], "Street Fighter 6": ["JUN 2, 2023  • ", "Powered by Capcom’s proprietary RE ENGINE, the Street Fighter 6 experience spans across three distinct game modes featuring World Tour, Fighting Ground and Battle Hub. Diverse Roster of 18 Fighters. Play legendary masters and new fan favorites like Ryu, Chun-Li, Luke, Jamie, Kimberly and more in this latest edition with each character featuring striking new redesigns and exhilarating cinematic specials. Street Fighter 6 offers a highly evolved combat system with three control types - Classic, Modern and Dynamic - allowing you to quickly play to your skill level. The new Real Time Commentary Feature adds all the hype of a competitive match as well as easy-to-understand explanations about your gameplay. The Drive Gauge is a new system to manage your resources. Use it wisely in order to claim victory.", "92"], "World Soccer Winning Eleven 7 International": ["APR 9, 2004  • ", "Winning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterful gameplay, beautifully rendered stadiums and picture-perfect player models. While on the field, players will experience true-to-life gameplay, with carefully tuned A.I., realistic pace and balance. [Konami]", "92"], "Team Fortress 2": ["OCT 10, 2007", "Team Fortress 2 (TF2) is the sequel to the game that put class-based, multiplayer team warfare on the map. TF2 delivers new gametypes, a signature art style powered by Valve’s next generation animation technology, persistent player statistics, and more. Unlike other \"class-based\" games that offer a variety of combat classes only, Team Fortress 2 packs a wild variety of classes which provide a broad range of tactical abilities and personalities, and lend themselves to a variety of player skills. Play as the flame-throwing Pyro, the room clearing Heavy, or the Spy, a master of disguises. Other classes include: Scout, Sniper, Medic, Engineer, Demoman, or Soldier. TF2 features the most advanced graphics of any Source-based game released to date – and the most exciting class-based action ever created. [Valve]", "92"], "System Shock 2": ["AUG 11, 1999  • ", "Like System Shock 1, there will be persistent levels (i.e., drop an item on one level, and you could go back later to retrieve it), gameplay elements like logs, inventory, skills, persistent world, leaning, hacking, rpg elements, multiple weapons and enemies, and a compelling storyline. Unlike most other first person shooters, the purpose of System Shock was not to kill everything in sight; nor was it a \"find the key to move onto the next level\" game. The plot was always present, but not so confining as in traditional shooters - there was almost always more than one task to accomplish. Levels were realistically designed and had logical reasons behind them. It is the principle of System Shock 2 to continue this game design. [sshock2.com]", "92"], "Tom Clancy's Splinter Cell: Chaos Theory": ["MAR 28, 2005", "The year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks, originating in North Korea. To succeed, you will employ a host of unconventional counterintelligence activities to gather intel, disrupt enemy operations and neutralize adversary targets. As Information Warfare evolves, so must the Splinter Cell. You must penetrate deeper into hostile territory and operate undetected, closer to the enemy than ever before. At your disposal is a lethal array of tactics ranging from Combat Knife techniques, experimental prototype weapons skills, and more radical hand-to-hand techniques such as the Inverted Chokehold. Experience the thrill of acting as a lone operative fighting tomorrow's threats in the field, and of cooperating online with a partner to accomplish crucial missions. Die in action, and the free world dies with you. Never-before-seen graphics technology offers the best visuals ever to appear on any platform. Advanced physics engine allows rag doll physics, particle effects and perfect interaction with the environment. The most complete arsenal of weapons and gadgets, from the combat knife to experimental prototype combat systems. Totally open level design with multipaths and optional secondary objectives. [Ubisoft]", "92"], "Elden Ring: Shadow of the Erdtree": ["JUN 21, 2024", "Rise, Tarnished, and let us walk a new path together. An upcoming expansion for ELDEN RING, Shadow of the Erdtree, is currently in development. We hope you look forward to new adventures in the Lands Between.", "92"], "Rome: Total War": ["SEP 22, 2004", "Rome: Total War is the next generation in epic strategy gaming from the critically acclaimed and award winning Total War brand. The aim of the game is to conquer, rule and manipulate the Roman Empire with the ultimate goal of being declared as the \"Imperator\" of Rome. Set in a time when the mighty Roman Empire emerged to conquer the known world against powerful enemies; when gladiators fought to a bloody death in the Coliseum; when Spartacus defied the might of the empire; when Hannibal led his invincible army and his war elephants across the Alps to strike fear into the very heart of Rome itself; and when Julius Caesar finally smashed the Barbarian Gauls. This was a time of brutal confrontation between civilisation and barbarism, and of civil war as the ancient world's only superpower turned on itself. A completely new Total War engine uses innovative technology and groundbreaking design to bring the world of ancient Rome to life to deliver the biggest and most cinematic battles ever seen in a videogame. So the battles in Rome: Total War maintain the epic scale that fans of Total War are used to, but now use high-detailed 3D polygonal troops and allows huge cities to be displayed on the battlefields. The result is truly spectacular. [Activision]", "92"], "Okami HD": ["DEC 12, 2017  • ", "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.", "92"], "Thief: The Dark Project": ["NOV 30, 1998", "Sneak through the shadows of 12 treacherous missions including haunted cathedrals, subterranean ruins, and forbidding prisons, in a dark and sinister city. Stalk your prey on the quest for stolen goods with your blackjack, sword and an assortment of unique arrows. Steal for money and uncover the hidden agendas of your allies and enemies as you play through an unravelling story of deception and revenge. Survive in a world where shadows are your only ally, trust is not an option, and confrontation results in death! [Eidos Interactive]", "92"], "Age of Empires II: The Age of Kings": ["SEP 30, 1999", "Age of Empires II: The Age of Kings is the sequel to the award-winning, best-selling real-time strategy game \"Age of Empires.\" Age of Empires II spans a thousand years, from the fall of Rome through the Middle Ages in which players lead one of 13 civilizations into greatness. The game keeps the epic scope of Age of Empires' game play while evolving the combat and economic features. [Microsoft]", "92"], "Unreal Tournament (1999)": ["NOV 30, 1999", "The stakes are high. On the one hand, fame, fortune, glory; on the other hand, death. Prove your skill in the arenas of the future, leading your team of computer-controlled \"bots\" to victory in the Grand Tournament, or compete with the best of the best via LAN or the Internet in seat-of-your-pants battles. While Unreal Tournament offers the finest in classic \"Deathmatch\" play, right out of the box you can compete in Team Deathmatch or Capture the Flag. Control strategic points on the map to rack up your score in Domination, or test your skills in Assault, as one team defends its base from the other. Each game type comes with its own special maps and rules, for never-ending variety and challenge. Add gameplay mutators such as Jump Match or InstaGib, and Unreal Tournament will keep your wits honed to a razor edge. [Infogrames]", "92"], "Sid Meier's Alpha Centauri": ["FEB 12, 1999  • ", "Legendary designer Sid Meier presents the next evolution in strategy games, with the most addictive, compelling gameplay yet. Explore the alien planet that is your new home and uncover its myriad mysteries. Discover over 75 extraordinary technologies. Build over 60 base upgrades and large-scale secret projects for your empire. Conquer your enemies with a war machine that you design from over 32,000 possible unit types. [Firaxis]", "92"], "Final Fantasy XIV: Endwalker": ["DEC 7, 2021  • ", "Endwalker is the fourth expansion pack for FINAL FANTASY XIV Online. Experience the climax of the Hydaelyn and Zodiark story, and encounter an even greater calamity than ever before as you travel to the far reaches of Hydaelyn and even to the moon.", "92"], "Out of the Park Baseball 17": ["MAR 22, 2016", "Step into the shoes of a team owner, GM, and/or field manager to own the future or rewrite the past of your favorite real-world club. Start a new career with 2016 Opening Day rosters of the real major or minor leagues, or span through 150 years of history and run any club from the past! Perform drafts, trades, scouting, waivers, team finances and personnel. Negotiate player contracts. Dive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch!", "92"], "The Witcher 3: Wild Hunt - Blood and Wine": ["MAY 30, 2016", "This expansion pack is an old-school add on with 20 hours of new adventures, where players will travel to the land of Toussaint.", "92"], "Tiger Woods PGA Tour 2003": ["NOV 5, 2002", "New course lineup: Twelve detailed courses include Pebble Beach Golf Links, TPC of Scottsdale and Torrey Pines South. New effects: Feel the sun, the wind, the fog and the grass as you walk 18. The most PGA TOUR pros: Play as or against Tiger Woods, Ty Tryon, Vijay Singh, Brad Faxon and many others. TrueSwing technology: Take full control over your swing, from straight drives to hooks and draws. Career mode: Purchase new equipment and lessons, hone your skills, and make your way to the top of the career rankings. [EA Sports]", "92"], "UFO 50": ["SEP 18, 2024", "UFO 50 is a collection of 50 single and multiplayer games from the creators of Spelunky, Downwell, and Catacomb Kids. Explore a variety of genres, from platformers and shoot 'em ups to puzzle games, roguelites, and RPGs. Our goal is to combine a familiar 8-bit aesthetic with new ideas and modern game design.", "91"], "Myth: The Fallen Lords": ["OCT 31, 1997", "Myth is arguably the first real-time strategy game to put the player in a true 3D landscape, with an emphasis on tactical battlefield action rather than base construction. Myth also happens to be one of Bungie's most successful pre-Halo releases, and shows off the company's range and ability in genres outside of first-person shooters. A single player mode features an engrossing and enjoyable plot, with you battling the evil and eponymous Fallen Lords, their evil leader, Balor and all manner of undead creatures, but Myth's multiplayer is where it really stands out. Bungie.net's game-matching technology has been much-emulated since, and at Myth's release, was something truly special. Multiple game modes including King of the Hill, Steal the Bacon and even co-op added huge variety to what was an outstanding and standard-setting game - and it still is. If ever an older game deserved another visit, it's Myth, with a huge, loyal and highly motivated following. [Bungie]", "91"], "Medal of Honor: Allied Assault": ["JAN 20, 2002", "As Lt. Mike Powell, member of the famed 1st Ranger Battalion, you'll battle through over 20 levels based on historical military campaigns of World War II. Fire period weapons and command authentic war vehicles as you silence the gun batteries at Port Arzew, survive the Omaha Beach landing, and more. [Electronic Arts]", "91"], "World of Warcraft: Wrath of the Lich King": ["NOV 13, 2008", "Players last visited Northrend in \"Warcraft III: The Frozen Throne,\" when Arthas Menethil fused with the spirit of Ner’zhul to become the Lich King, one of the most powerful beings in the Warcraft universe. He now broods atop the Frozen Throne deep in Icecrown Citadel, clutching the rune blade Frostmourne and marshaling the undead armies of the Scourge. In Wrath of the Lich King, the forces of the Alliance and the Horde venture into battle against the Scourge amid Northrend’s howling winds and fields of jagged ice. Wrath of the Lich King adds a rich variety of content to an already massive game. New features in the game’s second expansion include: Death Knight Hero Class: Create a high-level Death Knight character -- the game’s first hero class -- once certain challenges have been met. Increased Level Cap: Advance to level 80 and gain potent new talents and abilities along the way. Northrend: Explore the harsh new continent of Northrend, packed with new zones, quests, dungeons, monsters, and items -- and do battle with the undead armies of the Lich King. \"Inscription\" Profession: Learn this exciting new profession and gain unique ways to permanently enhance spells and abilities in the game. Siege Weapons and Destructible Buildings: Take the battle to another level with new player-vs.-player game mechanics and new battlefields to wage war on. New Character Customization: Change how characters look and express themselves, with different hairstyles and dance animations. [Blizzard Entertainment]", "91"], "I Was a Teenage Exocolonist": ["AUG 25, 2022", "Spend your teenage years on an alien planet in this narrative RPG with card-based battles. Explore, grow up, and fall in love. The choices you make and skills you master over ten years will determine the course of your life and the survival of your colony.", "91"], "F1 Challenge '99-'02": ["JUN 24, 2003", "Cutting-edge technology brings you the most accurate representation of Formula One to date. High-resolution car models include details right down to the very last shut line. Circuits include real life structures, helicopters, airplanes, panoramic skies, animated grid girls, motion captured pit crews, and even bumps in the track surface as they exist in reality. The glossy team-themed user interface puts you in the game and tracks your performance as a real life driver competing against the likes of world champion drives such as Damon Hill, Jacques Villeneuve, Mika Hakkinen, and Michael Schumacher. [Electronic Arts]", "91"], "Tekken 8": ["JAN 26, 2024", "TEKKEN 8 continues the tragic saga of the Mishima bloodline and its world-shaking father-and-son grudge matches. This latest saga begins with Jin Kazama facing off against Kazuya Mishima in a city-shattering face-to-face showdown. After defeating his father, Heihachi Mishima, Kazuya continues his conquest for global domination, using the forces of G Corporation to wage war on the world. Jin is forced to face his fate head on as he is reunited with his long lost mother, and seeks to stop his father Kazuya's reign of terror. Absent for over 25 years, Jun Kazama re-joins TEKKEN 8 as a playable character. [Bandai Namco]", "91"], "IL-2 Sturmovik": ["NOV 18, 2001", "Fly 31 types of Russian, German and American planes. Engage in air-to-air and air-to-ground battles. Multiplay with up to 32 players in dogfight and 16 players in cooperative missions. Use custom paint schemes, squadron nose art, numbering on wings, and national markings for each plane. [Ubi Soft]", "91"], "Metal Gear Solid V: The Phantom Pain": ["SEP 1, 2015  • ", "Following the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director Hideo Kojima's first time incorporating open world gameplay to the groundbreaking METAL GEAR franchise.", "91"], "Tom Clancy's Splinter Cell": ["FEB 19, 2003", "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII. [Ubi Soft]", "91"], "Forza Horizon 5": ["NOV 9, 2021  • ", "Your Ultimate Horizon Adventure awaits! Explore the vibrant and ever-evolving open world landscapes of Mexico with limitless, fun driving action in hundreds of the world’s greatest cars.", "91"], "Crysis": ["NOV 13, 2007", "Crysis is a next-generation PC first-person shooter from Crytek, the award-winning developers of \"Far Cry.\" It is 2020, and global tensions have reached boiling point as the U.S. and North Korea square off in the South China Sea. At stake: a mysterious artifact uncovered by a team of U.S. archeologists. The North Korean government quickly seizes the area, prompting the U.S. to dispatch an elite team of Delta Force operatives on a rescue mission. During the siege the true nature of the artifact quickly emerges, pointing to the existence of an alien presence on Earth, and ultimately the trigger for a massive-scale alien invasion. The battle to save Earth begins as the aliens' flash freeze the tropics into a ghostly-white frozen landscape. As gamers take up arms against the aliens, they will be outfitted with customizable weapons and a high tech Nanosuit, allowing them to adapt their tactics and abilities to a hostile, ever-changing environment and a mysterious enemy. [Electronic Arts]", "91"], "World of Warcraft: The Burning Crusade": ["JAN 16, 2007", "Several years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal to investigate the realms beyond the known world. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought vanquished have returned to renew their terrible Burning Crusade? New Player Races: New allies will join the game, expanding the story line and allowing players to develop powerful new characters within the world. Higher Level Limit: The game's level cap is being raised to 70, and with these new levels will come meaningful spell, ability, and talent upgrades for each character class. New Lands and Battlegrounds: Explore the magical realms of the Blood Elves and Draenei, journey through the Dark Portal into untamed Outland, and visit dungeons and battlefields previously inaccessible to players. Flying Mounts: In Outland, players will gain access to unique airborne mounts that will allow for smoother travel over some of that region's more hazardous terrain. [Blizzard]", "91"], "Tiger Woods PGA Tour 2005": ["SEP 20, 2004", "TigerProofing is a revolutionary course-altering system that allows players to modify course dynamics and create the most intensely competitive course imaginable. Alter tee-box length, width and patterns on fairways and greens, the depth of a greenside bunker, and even the color of the leaves on the trees, course moisture and the season which you play. Take on the legends of golf including Arnold Palmer, Jack Nicklaus, and Ben Hogan and become a legend yourself! EA SPORTS GameFace II: The industry-leading GameFace technology just got a whole lot deeper with more control and freedom to express your creative vision from a youthful prodigy to a grizzled old veteran. Eight new licensed courses and two new fantasy courses have been added for a total of 14 courses. New licensed courses for console only include Coeur d?Alene and Colonial Country Club. New licensed courses for both console and PC include, Sherwood Country Club, Fancourt Golf Club Estate and Troon North ? Monument Course. Compete as or against 15 different PGA TOUR players including Tiger Woods, John Daly, Vijay Singh, Charles Howell III, Notah Begay III, and Jesper Parnevik, among others. Total Precision Swing: New putting and chipping systems allow for more control on the green or when you leave an approach shot short. [EA Sports]", "91"], "The Longest Journey": ["NOV 16, 2000", "An epic 3-D adventure spanning over 150 unique locations across two distinct and detailed worlds. [Funcom]", "91"], "Star Wars Jedi Knight: Dark Forces II": ["OCT 9, 1997  • ", "In Dark Forces, Kyle Katarn, a young mercenary successfully infiltrated the Empire. Jedi Knight continues the story of Katarn as he embarks on a quest into his past and learns the mysterious ways of the Jedi. With this knowledge, he must stop seven Dark Jedi from unlocking the powers of a hidden Jedi burial ground. This task forces Katarn to decide his destiny. If he chooses the Dark side, he will come into enormous power. If he chooses the Light side, he faces seemingly insurmountable evil. Whatever path Katarn chooses will change the face of the galaxy forever. [LucasArts]", "91"], "Tony Hawk's Pro Skater 2": ["OCT 25, 2000", "Players can choose to skate with the skills of Tony Hawk, the most legendary pro of all time, or as one of 12 pro skaters from the star-studded lineup. The game's intuitive and solid control scheme allows players to perform hundreds of tricks in a variety of realistic, obstacle-filled, real-world locations. [Activision]", "91"], "The Operative: No One Lives Forever": ["NOV 11, 2000", "Travel across the globe in this award winning action shooter set in the swinging sixties. Your Mission: Assume the role of Cate Archer, a beautiful but deadly Operative working for UNITY - a super secret organization fighting to free the world from the clutches of H.A.R.M. From tense subterfuge to in-your-face combat, NOLF ups the ante for plot-driven, 1960's-influenced spy action with killer weapons, vivid international locales and deadly arch villains. Equipped with an arsenal of powerful weapons and ingenious gadgets, you must unravel a mystery that will lead you halfway around the world in a desperate search for answers. Includes four new levels featuring Cate in her younger days as a thief. [Sierra]", "91"], "Street Fighter IV": ["JUL 1, 2009  • ", "At the completion of the second World Warrior Tournament, the Shadaloo crime syndicate was left in ruins, its grandmasters defeated and scattered to the winds. Now, the mysterious Seth, CEO of the S.I.N. Corporation, has set up yet another tournament and invited a blend of old friends and new faces to battle again for the title of the world's strongest. With 25 characters (including the original 12 street fighters), a blend of 2D and 3D graphics, and the new focus-attack system, Street Fighter has returned with a vengeance.", "91"], "Fallout 3": ["OCT 28, 2008", "[Metacritic's 2008 PC Game of the Year] Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world – radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America's First Choice in Post Nuclear Simulation. Vault 101 - Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth. [Bethesda Softworks]", "91"], "Fez": ["MAY 1, 2013  • ", "In Fez, you play as Gomez, a 2D creature living in what he believes is a 2D world. Until a strange and powerful artifact reveals to him the existence of a mysterious third dimension!", "91"], "No One Lives Forever 2: A Spy in H.A.R.M.'s Way": ["SEP 30, 2002", "A humorous story-driven first-person shooter featuring the beautiful but deadly UNITY operative Cate Archer. Cate must investigate a super-secret Soviet project that, if successful, could bring about a third world war. Armed with an assortment of conventional and experimental weaponry and gadgets, players will explore exotic locales, circumvent devious traps, and contend with deadly agents determined to take Cate out of the spy trade once and for all. [Sierra]", "91"], "Mark of the Ninja": ["OCT 16, 2012", "Mark of the Ninja is a side-scrolling stealth action game from Klei Entertainment that combines fluid 2D animation with intense stealth gameplay.", "91"], "Disco Elysium": ["OCT 15, 2019", "Disco Elysium is an open world role playing game. You’re a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders or take bribes. Become a hero or an absolute disaster of a human being.", "91"], "Caves of Qud": ["DEC 5, 2024", "Caves of Qud is a science fantasy roguelike epic steeped in retrofuturism, deep simulation, and swathes of sentient plants. Come inhabit an exotic world and chisel through layers of thousand-year-old civilizations.", "91"], "Dark Souls II": ["APR 25, 2014", "Prepare to die... Again. Dare yourself to engage against intense gameplay in a vast world powered by a new engine. Immerse yourself into mind-bending environments filled with new twisted monsters and deadly bosses. A vast array of threats will prey on human senses & phobias - auditory hallucinations, vertigo, acrophobia, etc. More intricate customization options provide weapons and armor tailoring to player style. [Namco Bandai Games]", "91"], "Call of Duty": ["OCT 29, 2003", "Call of Duty delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield. No one soldier or nation single-handedly won the war. For the first time, Call of Duty captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism. [Activision]", "91"], "The Sims 2": ["SEP 14, 2004", "The Sims 2 is the first entirely-new generation of The Sims, the ground-breaking game that allowed players to create and control people. The Sims 2 challenges you to direct the journey of your Sims' lives as they grow from infancy through childhood, teenage life and adulthood. Starting with a personality that you give them (or that they inherit from their parents), your Sims will develop in unique ways based on your choices and influence. As they progress through life, your Sims will collect memories which shape who they are, what options they have and how they behave. These experiences can have a short or long-term effect on relationships between family members and friends. Experiences between Sims when they are children can affect their relationships as teens and adults. Your Sims can have casual friendships or make life-long enemies. [Electronic Arts]", "90"], "Final Fantasy XIV: Shadowbringers": ["JUL 2, 2019  • ", "Take part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS. New jobs: Gunbreaker and Dancer New races: Viera and Hrothgar Level cap increased: 70 to 80 New cities: The Crystarium and Eulmore Journey through expansive new areas, such as the Rak’tika Greatwood, Amh Araeng, Il Mheg and Lakeland. New trails, including harrowing encounters with Titania and Innocence. New beast tribes: pixies, Nu Mou, and dwarves New 8-player raid: Eden An exciting new series of alliance raids YoRHa:Dark Apocalypse The Restoration of the Holy See of Ishgard - In the aftermath of the Dragonsong War, Disciples of the Hand and Land work together to rebuild Ishgard", "90"], "World of Warcraft: Cataclysm": ["DEC 7, 2010  • ", "In Cataclysm, players witness the face of Azeroth being altered forever, as the corrupted Dragon Aspect Deathwing awakens from his subterranean slumber and erupts onto the surface, leaving ruin and destruction in his wake. As the Horde and Alliance race to the epicenter of the cataclysm, the kingdoms of Azeroth will witness seismic shifts in power, the kindling of a war of the elements, and the emergence of unlikely heroes who will rise up to protect their scarred and broken world from utter devastation. New features in the game's third expansion include: Two New Playable Races: Adventure as the cursed worgen with the Alliance or the resourceful goblins with the Horde. Increased Level Cap: Advance to level 85 and earn new abilities, tap into new talents, and progress through the path system, a new way for players to customize characters. Classic Zones Remade: Quest to level 60 as you never have before. Familiar zones across the original continents of Kalimdor and the Eastern Kingdoms have been reforged by the cataclysm and updated with new quests and content. Flying Mounts in Azeroth: Explore Kalimdor and the Eastern Kingdoms from a whole new perspective. Guild Advancement: Progress as a guild to earn guild levels and guild achievements. New High-Level Content: Explore newly opened parts of the world, including Uldum, Grim Batol, and the great sunken city of Vashj'ir beneath the sea, and enjoy even more high-level raid content than in previous expansions. New PvP Zone & Rated Battlegrounds: Take on PvP objectives and daily quests on Tol Barad Island, a new Wintergrasp-like zone, and wage war in all-new rated Battlegrounds. Archaeology: Master a new secondary profession to unearth valuable artifacts and earn unique rewards. New Race and Class Combinations: Explore Azeroth as a gnome priest, blood elf warrior, or one of the other never-before-available race and class combinations. [Blizzard Entertainment]", "90"], "World of Goo": ["OCT 12, 2008", "World of Goo is a physics based puzzle / construction game. The millions of Goo Balls that live in the beautiful World of Goo don't know that they are in a game, or that they are extremely delicious. [2D Boy]", "90"], "Slay the Princess": ["OCT 23, 2023", "You're here to slay the princess. Don't believe her lies.", "90"], "Black & White": ["MAR 26, 2001", "Peter Molyneux's highly anticipated \"god game,\" a blend of the genres including strategy, sim, RPG, and puzzle, features the player as a new god in the lands of Eden who must reign with the help of uniquely evolving animals in either a benign or evil fashion.", "90"], "Shin Megami Tensei V: Vengeance": ["JUN 13, 2024", "Embark on this definitive version of the critically acclaimed Shin Megami Tensei V, massively expanded with a brand-new storyline featuring new locations, demons, and choices to make that will dictate the fate of all existence.", "90"], "Portal": ["OCT 10, 2007", "Portal is a new single player game from Valve. Set in the mysterious Aperture Science Laboratories, Portal has been called one of the most innovative new games on the horizon and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate, and surmise the possibilities in a given environment; similar to how Half-Life 2's Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space. [Valve]", "90"], "Tetris Effect": ["JUL 23, 2019", "From deep beneath the ocean to the furthest reaches of outer space, Tetris Effect’s 30-plus stages are more than just backdrops; together with music, characters, and animations tailor-made for each level and triggered by your actions, they’re all meant to make you feel something — to convey a mood, or even provoke an emotional response. [Enhance, Inc.]", "90"], "NHL 2001": ["SEP 28, 2000", "High-flyin', hard hittin', intense powerplay hockey is back with EA Sports' NHL 2001, bringing gamers out of the stands and onto the ice. Lace up the skates and play with or against all 30 National Hockey League teams, including the expansion Columbus Blue Jackets and Minnesota Wild. [Electronic Arts]", "90"], "Deus Ex": ["JUN 23, 2000", "The game that incorporates RPG, action, adventure, and 1st-person shooter genres into a chaotic blend of real-world conspiracies, cliffhangers, and plot twists. A richly simulated world of unparalleled interactivity, engineered to react logically to your every action. The decisions and consequences are yours. [Eidos Interactive]", "90"], "Tony Hawk's Pro Skater 3": ["MAR 28, 2002", "Featuring eight massive levels filled with people, traffic, and other interactive elements, the game's environments are brought to life with richer graphics and advanced special effects optimized for today's PC video cards. Smoother life-like animations and significantly improved tricks capture the style of the world's best skateboarding pros. Further improving on the franchise's intuitive control scheme, the game allows players to perform tricks and combos in some of the world's most popular skate locations including Los Angeles, Canada and Tokyo. The enhanced skate park editor allows gamers to create the ultimate park up to twice the size of parks in Tony Hawk's Pro Skater 2. The Create-A-Skater features a new female skater model, and the ability to modify almost every aspect of their appearance, from accessories to clothing to hair color. [Activision]", "90"], "Half-Life 2: Episode Two": ["OCT 10, 2007", "Half-Life 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions. In Episode Two, you must battle and race against Combine forces as you traverse the White Forest to deliver a crucial information packet stolen from the Citadel to an enclave of fellow resistance scientists. Episode Two extends the award-winning Half-Life gameplay with unique weapons, vehicles, and newly-spawned creatures. [Valve]", "90"], "Braid": ["APR 10, 2009", "Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more. Braid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world. Braid is a 2-D platform game where you can never die and never lose.", "90"], "The Chronicles of Riddick: Escape From Butcher Bay": ["DEC 8, 2004  • ", "Set before the events of both Universal Pictures' \"The Chronicles of Riddick,\" starring Vin Diesel, and the 2000 cult classic \"Pitch Black,\" which first introduced Diesel as enigmatic anti-hero Riddick, the game tells the story of Riddick's dramatic escape from the previously inescapable triple max security slam Butcher Bay, home to the most violent prisoners in the galaxy. The Chronicles Riddick: Escape From Butcher Bay will blend action and stealth elements, as players navigate Riddick through the harsh environments of the slam - dank tunnels, dimly lit corridors, and other hazardous areas filled with guards, savage inmates and deadly creatures that prowl the darkness. [Vivendi Universal]", "90"], "Ghost Trick: Phantom Detective": ["JUN 30, 2023", "Ghost Trick is a story of mystery and intrigue that blends fun logic puzzles with the world of the supernatural, making for an entirely new and unique experience in the handheld gaming space. Part adventure game, part puzzle game, Ghost Trick's gameplay will challenge player's brains while its distinct art elements and character designs will deliver the fun.", "90"], "Sid Meier's Civilization III": ["OCT 30, 2001", "In Civilization III, you'll find new pathways to explore and strategies to employ, greatly expanded diplomacy, more powerful combat, a new trade system, new technologies, more powerful tools to build and manage your empire, and the most detailed and beautiful art, animations and sound ever found in the genre. [Infogrames]", "90"], "Hi-Fi Rush": ["JAN 25, 2023", "Feel the beat as wannabe rockstar Chai and his ragtag team fight against an evil megacorp with raucous rhythm combat! From Tango Gameworks comes Hi-Fi RUSH, an all-new action game where the world syncs to the music.", "90"], "God of War: Ragnarok": ["SEP 19, 2024", "The freezing winds of Fimbulwinter have come to Midgard, making survival for Kratos, Atreus, and Mimir in the Norse wilds even more challenging than before. Kratos, still bearing the knowledge of his past mistakes, wants to spare Atreus the bloody lessons he learned from his conflict with gods. He wants to keep his son safe, above all, and their confrontation with Baldur has vindicated the belief that only tragedy will come from further entanglements with the Aesir. Together, Kratos and Atreus will have to make a choice about which path they will take. Whatever they choose will define the fate of all those living in the Nine Realms as Ragnarok approaches. Whatever your choice of combat strategy, the enemies that await in God of War Ragnarök will be ready. The realms have grown harsher, and a whole host of new creatures from across Norse mythology will test your skills. God of War Ragnarök will take you to the previously unreachable Vanaheim, Svartalfheim, and Asgard - as well as to new areas from locations featured in the last game. Exploring the realms will take you everywhere from verdant, otherworldly jungles to intricate subterranean mining networks. This next installment in the series will bring you a more diverse, beautiful, and mysterious variety of locations than in any other God of War game.", "90"], "Silent Hunter III": ["MAR 15, 2005", "Command the cunning and deadly U-boats of the North Atlantic and experience the tension-filled atmosphere of a WWII submarine movie. The king of submarine simulations returns with an all-new 3D game engine, new crew-command features, and more realistic action than ever before. The game includes a career campaign, patrols that have both single and historical missions, a mission editor, and a multiplayer feature. Whether it’s stalking destroyers or hiding from depth charges, players will experience their own personal war story. The spectacular graphics, multiplayer options, and suspenseful gameplay combine to create the most impressive submarine simulation ever. [Ubisoft]", "90"], "Thank Goodness You're Here!": ["AUG 1, 2024", "After arriving early for a big meeting with the mayor of a bizarre Northern English town, a traveling salesman takes the time to explore and meet the locals, who are all very eager to give him a series of increasingly odd jobs... Thank Goodness You're Here! is a comedy slapformer, which unfolds over time as the players' exploration and antics leave their mark on the strange town of Barnsworth. With each completed odd job, new areas of the town open up, stranger and stranger tasks become available, and the clock ticks towards our salesman's big meeting. The town's colorful inhabitants are brought to life with vibrant hand-drawn animation, fully voiced dialogue, and wall-to-wall double entendres.", "90"], "DAVE THE DIVER": ["JUN 28, 2023", "Welcome to 'DAVE THE DIVER', a marine adventure set in the mysterious Blue Hole. Explore the sea with Dave by day, and run a sushi restaurant at night. Uncover the secrets of the Blue Hole, and unwrap this deep sea mystery involving 3 friends, each with distinct personalities. New adventures await.", "90"], "Sid Meier's Civilization V": ["SEP 21, 2010  • ", "With over nine million units sold worldwide, and unprecedented critical acclaim from fans and press around the world, Sid Meier's Civilization is recognized as one of the greatest strategy franchises of all-time. Now, Firaxis Games will take this incredibly fun and addictive strategy game to unprecedented heights by adding new ways to play and win; new tools to manage and expand your civilization; extensive modding capabilities; and intensely competitive multiplayer options. Civilization V will come to life in a beautifully detailed, living world that will elevate the gameplay experience to a whole new level making it a must-have for gamers around the globe!", "90"], "The Stanley Parable: Ultra Deluxe": ["APR 27, 2022", "The Stanley Parable: Ultra Deluxe is an expanded re-imagining of 2013's The Stanley Parable. You will play as Stanley, and you will not play as Stanley. You will make a choice, and you will become powerless. You are not here to win. The Stanley Parable is a game that plays you.", "90"], "Deus Ex: Human Revolution": ["AUG 23, 2011", "In Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew about your job changes. At a time when scientific advancements are routinely turning athletes, soldiers and spies into super-enhanced beings, someone is working very hard to ensure mankind's evolution follows a particular path. You need to discover why - because the decisions you take and the choices you make will be the only things that can determine mankind's future.", "90"], "Flight Simulator 2002": ["OCT 19, 2001", "Includes a wide variety of aircraft for you to fly-from a new Cessna 172S single-engine trainer and a Caravan floatplane to the Boeing 747-400 jumbo jet. You can splash down in a lake, hover in the Bell 206B JetRanger III helicopter, or practice aerobatics in the Extra 300S. [Microsoft]", "90"], "Dota 2": ["JUL 9, 2013", "Dota 2 features the characters and factions from the original Defense of the Ancients title with new features.", "90"], "Guild Wars 2": ["AUG 28, 2012", "Guild Wars 2 draws from the game mechanics that made the original Guild Wars one of the most popular online games and adds a fully persistent world. Like its predecessors, Guild Wars 2 does not have a subscription fee. Guild Wars Eye of the North provide a Hall of Monuments where players' accomplishments are memorialized and eventually inherited by their Guild Wars 2 characters, unlocking exclusive items and bonuses in Guild Wars 2. [NCsoft]", "90"], "Final Fantasy VII Rebirth": ["JAN 23, 2025", "FINAL FANTASY VII REBIRTH is the new story in the FINAL FANTASY VII remake project, a reimagining of the iconic original game into three standalone titles by its original creators. In this game, players will enjoy various new elements as the story unfolds, culminating in the party’s journey to “The Forgotten Capital” from the original FINAL FANTASY VII. Cloud and his comrades escape the city of Midgar in pursuit of the fallen hero, Sephiroth. As they travel across the world, they find themselves on a journey that will decide the fate of the planet. In this standalone adventure for fans and newcomers, Cloud and his comrades venture across the planet, their fates unwritten, making each step outside the dystopian city of Midgar fresh and mysterious. [Square Enix]", "90"], "Into the Breach": ["FEB 27, 2018  • ", "Control powerful mechs from the future to defeat an alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game.", "90"], "GTR 2": ["SEP 29, 2006", "Extending the ground-breaking physics engine found in GTR, GTR 2 takes the thrill of driving to new heights. GTR 2, which is the official simulation of the FIA GT championship, features more than 140 high detailed cars and 34 different track-layouts in a hyper realistic racing world with breathtaking real-world-like effects. With a revolutionary Driving School Mode, GTR 2 will teach everybody how to become a real race driver. [10Tacle Studios]", "90"], "Grand Theft Auto IV": ["DEC 2, 2008  • ", "[Metacritic's 2008 PS3 Game of the Year; Also known as \"GTA IV\"] What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them an a living nightmare for those who don't. [Rockstar Games]", "90"], "Total War: Shogun 2": ["MAR 15, 2011  • ", "Shogun 2 is the ultimate refinement of the original formula with a new, cutting-edge AI, more polish and online functionality than ever before. The result is the perfect mix of real-time and turn-based strategy gaming that invites both veterans of Total War and new players to experience the enjoyment and depth of the series.", "90"], "The Legend of Heroes: Trails from Zero": ["SEP 27, 2022", "The Crossbell State, located in western Zemlya-- Once the site of fierce territorial battles, it has since developed into one of the continent's leading trade and financial centers. However, pressure from the Erebonian Empire and the Calvard Republic is steadily increasing. While corrupt officials from both sides remain locked in political disputes, the mafia and underground criminal organizations are preparing to start a war. In the midst of all this chaos, the Crossbell Police Department has lost the trust of its people. Among them are Lloyd Bannings, a rookie agent, Elie MacDowell, granddaughter of Crossbell's mayor, Tio Plato, a young sorcereress who wields an orbal staff, and Randy Orlando, a former security guard. The foursome are assigned to a new department, the Special Support Section, where they are left with no choice but to join forces in the face of adversity. This is a story about four unlikely heroes fighting to overcome the walls defining their way of life.", "90"], "The Witcher 3: Wild Hunt - Hearts of Stone": ["OCT 13, 2015", "Hearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each Runeword impacts a different aspect of in-game mechanics and allows the players to experiment with various strategies and tactics. [CD Projekt]", "89"], "Alan Wake II": ["OCT 27, 2023", "Shed some light on what has long been obscured by darkness. After 11 long years, the writer's return is a reality and the dangers lurking in the dark are even more sinister than the Taken roaming Bright Falls. Alan Wake 2 turns up the level of dread as our very first dive into the survival horror genre, so expect a chilling experience with familiar psychological horror elements. Be careful out there. Monsters wear many faces.", "89"], "Star Wars Jedi Knight II: Jedi Outcast": ["MAR 26, 2002", "Several years have passed since Kyle Katarn avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi. Allowing his Force powers to languish for fear of falling to the Dark side, Kyle set aside his lightsaber, vowing never to use it again. But when a new and menacing threat to the galaxy emerges, Kyle knows he must reclaim his past in order to save his future. Players assume the role of Kyle as they employ a unique mix of weapons, Force powers and your lightsaber in both single- and multiplayer modes of first-person action. [LucasArts]", "89"], "Devil May Cry 5": ["MAR 7, 2019  • ", "A brand-new entry in the over-the-top action series comes complete with its signature blend of high-octane stylized action and otherworldly and original characters the series is known for. Years have passed since the legions of hell have set foot in this world, but now a new demonic invasion has begun, and humanity’s last hope will rest in the hands of three lone demon hunters, each offering a radically different play style. United by fate and a thirst for vengeance, these demon hunters will have to face their demons if they hope to survive. [Xbox.com]", "89"], "Neon White": ["JUN 16, 2022", "Neon White is a lightning fast first-person action game about exterminating demons in Heaven. You are White, an assassin handpicked from Hell to compete with other demon slayers for a chance to live permanently in Heaven. The other assassins seem familiar, though… did you know them in a past life? Features: • You play as Neon White, an assassin plucked from Hell to compete with other demon slayers for a shot at redemption. • Collect “Soul Cards” to attack your foes or discard them to use unique movement abilities. • Compete for the best times by cleverly combining cards to discover massive shortcuts. • Uncover Heaven’s mysteries by getting to know the other assassins… did you know them in a past life?", "89"], "Age of Mythology": ["NOV 1, 2002  • ", "Age of Mythology transports players to a time when heroes did battle with monsters of legend and the gods intervened in the affairs of mortal men. Players wage war using human armies and diplomacy, progress through development ages, enhance military and economic performance with improvements, and manage economics through resource gathering and trade. Mythology enters the mix when players call upon the gods to act on their behalf or reinforce their armies with more than 20 mythological creatures. Ensemble Studios' new 3D engine adds a deep richness of graphical detail and creates a unique new title based on the ancient cultural history of the Greek, Norse, and Egyptian cultures, which are divided into nine detailed civilizations. [Microsoft]", "89"], "The Walking Dead: A Telltale Games Series": ["APR 24, 2012", "Based on Robert Kirkman's comic book series, The Walking Dead brings to life a world devastated by an undead apocalypse and the horrifying choices you're forced to make to survive. Play the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a world devastated by the undead. With corpses returning to life and survivors stopping at nothing to maintain their own safety, protecting an orphaned girl named Clementine may offer you redemption in a world gone to hell.", "89"], "Like a Dragon: Infinite Wealth": ["JAN 26, 2024", "EPIC EMOTIONAL DRAMA Two larger-than-life heroes brought together by the hand of fate, or perhaps something more sinister… Ichiban Kasuga, an unstoppable underdog who’s no stranger to crawling up from rock bottom, and Kazuma Kiryu, a broken man facing down his last days. BEST-IN-CLASS RPG ACTION Experience one-of-a-kind combat with dynamic, fast-paced RPG battles where the battlefield becomes your weapon, and anything goes. Adapt your party’s skills to the situation with outlandish jobs and customizations to strategically subdue enemies with over-the-top moves. INFINITE ADVENTURE Live it up in Japan and explore all that Hawaii has to offer in an adventure so big it spans the Pacific. Unforgettable moments await at every step of the journey with a unique mix of quests and activities to enjoy at your leisure.", "89"], "Dark Souls III": ["APR 11, 2016  • ", "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.", "89"], "Pillars of Eternity": ["MAR 26, 2015", "Eternity aims to recapture the magic, imagination, depth, and nostalgia of classic RPG's that Obsidian enjoyed making - and playing. Eternity takes the central hero, memorable companions and the epic exploration of Baldur’s Gate, adds in the fun, intense combat and dungeon diving of Icewind Dale, and ties it all together with the emotional writing and mature thematic exploration of Planescape: Torment. Choose to play as one of the six playable races: Human, Aumaua, Dwarf, Elf, Godlike, and Orlan. Whether you're playing a stout Dwarf, a towering Aumaua, or one of the otherworldly Godlike, Eternity's plethora of playable races scratch every role-playing itch you may have and allow for deep character customization. [Obsidian]", "89"], "The Elder Scrolls III: Morrowind": ["MAY 1, 2002  • ", "An epic, open-ended single-player game where you create and play any kind of character you can imagine. Be the noble hero embarking on an epic quest, or an insidious thief rising to leadership of his guild. Be a malevolent sorcerer developing the ultimate spell of destruction, or a reverent healer searching for the cure to a plague. Your actions define your character, and your gameplay changes and evolves in response to your actions. Confront the assassins' guild, and they take out a contract on you. Impress them, and they try to recruit you instead. No two sagas are the same in the world of Morrowind. [Bethesda Softworks]", "89"], "Pizza Tower": ["JAN 26, 2023", "Peppino Spaghetti, a surprisingly agile and powerful fat balding italian, is on a mission to destroy the titular Pizza Tower in order to save his restaurant from annihilation. Follow him through his rampage across the many wacky floors of the tower, collecting toppings and beating up monsters! PLAY as Peppino Spaghetti, the supersonic italian middle-aged man! And sometimes Gustavo. Pizza Tower is a fast paced 2D platformer inspired by the Wario Land series, with an emphasis on movement, exploration and score attack. Featuring highly stylized pixel art inspired by the cartoons from the '90s, and a highly energetic soundtrack.", "89"], "World Soccer Winning Eleven 9": ["APR 28, 2006", "Winning Eleven 9 features the realism, intuitive play and fast-paced action of the ever-popular series. The handheld version is almost identical in terms of available clubs and international sides, with 57 national sides lining up alongside 136 club teams. The game also benefits from a number of exclusive features designed to showcase the PSP's capabilities. The highly-competitive multi-player aspects of the game are highlighted using the hardware's wireless systems. Using this, players within a certain network radius can challenge rival Winning Eleven 9 fans to games, with all data related to match results goals for, goals against, wins, etc retained in a running tally. Solo players can also hone their skills within six different leagues and a host of cup tournaments, and the PSP game can also be linked to the PlayStation 2 version of Winning Eleven 9 for data exchange. Using this, players can import teams they have created within the PlayStation 2 game for use against friends on their PSP, or swap teams with other PSP users.", "89"], "Dead Cells": ["AUG 6, 2018  • ", "Dead Cells is a rogue-lite, metroidvania action-platformer. You'll explore a sprawling, ever-changing castle... assuming you’re able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat.", "89"], "There is no game : Wrong dimension": ["AUG 6, 2020", "There is no game. So don't go messing things up by clicking everywhere. You don’t want to be kicked out of your video game world, do you? Of course not!", "89"], "Slay the Spire": ["JAN 23, 2019", "We fused card games and roguelikes together to make the best single player deckbuilder we could. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and Slay the Spire!", "89"], "Left 4 Dead": ["NOV 17, 2008", "Fight together...or die alone. A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured, wildly violent psychopaths, attacking the uninfected on sight. One of the \"lucky\" few apparently immune to the sickness, you, unfortunately, are also trapped in a city crawling with thousands of the bloodthirsty Infacted. Together with a handful of fellow Survivors, you must fight your way to safety or die alone. A co-operative multiplayer action game from the makers of \"Counter-Strike,\" Left 4 Dead is built atop the most advanced version of the Source Engine and introduces version 2 of Turtle Rock's artificial intelligence (A.I.) technology. [Turtle Rock Studios]", "89"], "Left 4 Dead 2": ["NOV 16, 2009", "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns. Play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan. You'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You’ll also encounter five new \"uncommon\" common infected, including the terrifying Mudmen. Helping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you’ll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play. [Valve]", "89"], "F1 2017": ["AUG 24, 2017", "Win the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline.", "89"], "Mass Effect": ["MAY 28, 2008", "As the first human on the galactic stage, you must uncover the greatest threat to civilization. Your job is complicated by the very fact of your humanity, as no one trusts you and you need to find a way to convince everyone of the grave threat. You will travel across an expansive universe to piece the mystery together. As you discover and explore the uncharted edges of the galaxy, you come closer to an overwhelming truth - learning that the placid and serene universe you know is about to come to a violent end and that you may be the only person who can stop it! In addition to the main story arc of the game, players are be able to visit a large number of uncharted, unexplored planets which are side quests independent from the main story. At any time during the campaign, a player can choose to explore one of these planets and have an opportunity to discover new alien life, resources, ruined civilizations and powerful technologies. Talents and abilities are upgradeable and advanced talent options become available at higher levels. Weapons and vehicles are customizable to include various effects, abilities and upgrades using the \"X-Mod\" system. Each character class have unique talents and abilities which increase in power as the player progresses through the game. Optimized controls have been designed specifically for the PC. Fully customizable controls â?? PC gamers can re-map the control scheme any way they like. Run & Gun Control â?? Players can assign biotic powers or skills to â??hot keysâ?? allowing them to play Mass Effect with a heavier focus on action. New decryption mini-game. New inventory screen GUI and functionality â?? The enhanced inventory system makes it easier for players to equip and modify their weapons and armor. [Microsoft]", "89"], "Guild Wars": ["APR 26, 2005", "Guild Wars takes the best elements of today's massively multiplayer online games and combines them with a new mission-based design that eliminates the tedium of those games. You can meet new friends in towns or outposts, form a party, and then go tackle a quest together. Your party always has its own unique copy of the quest map, so camping, kill-stealing, and long lines to complete quests are all things of the past. Within a quest you have unprecedented freedom and power to manipulate the world around you: your magic can build bridges and open up new pathways, or it can burn down forests and tear the ground asunder. You don't have to spend countless hours on a leveling treadmill to get to the interesting parts of the game, because combat is designed to be strategically interesting and challenging right from the beginning. You don't have to spend hours running around the world to prepare for a quest, because Guild Wars allows you to instantly travel to the beginning of any quest that you've previously unlocked. You'll never spend days playing only to discover that choices you made early on have left you with a permanently uncompetitive character, because the unique skill system in Guild Wars allows infinite experimentation but doesn't allow bad decisions to ruin a character. And you'll never meet new players only to discover that you can't play with them or compete against them because their characters are on a different server than yours; in Guild Wars, all characters live in one seamless world. [NCsoft]", "89"], "The Walking Dead: Episode 5 - No Time Left": ["NOV 21, 2012", "The concluding episode of a five-part series set in Robert Kirkman’s zombie apocalypse. With time running out and the odds stacked against you, Clementine’s fate is in your hands. The culmination of your choices leads to the dramatic conclusion of this first season of The Walking Dead. Purchase of this DLC requires The Walking Dead - Episode 1: A New Day.", "89"], "Max Payne": ["JUL 23, 2001", "Max Payne is a man with nothing to lose in the violent, cold urban night. A fugitive undercover cop framed for murder, and now hunted by cops and the mob. A man with his back against the wall, fighting a battle he cannot hope to win. Prepare for pain with this much-anticipated 3rd-person shooter. [Rockstar Games]", "89"], "Out of the Park Baseball 15": ["APR 21, 2014", "In OOTP 15 you guide your team to glory. Set up your roster, trade players, draft the next superstar, negotiate with free agents, discover talent in the rule-5 draft, keep an eye on your minor leaguers, scout foreign countries or other leagues, it's all here. On top of the GM features, OOTP sports a great baseball simulation engine with stunning statistical accuracy and extensive play-by-play. It is widely regarded as the most realistic baseball game available, by far! You call all the shots from the dugout and see the game unfold before your eyes.", "89"], "World in Conflict": ["SEP 18, 2007", "War is Coming Home. West Germany, 1989. To avoid certain collapse, the Soviet army boldly advances into Europe. NATO responds only to be met on a second front -- a diversionary attack on the American homeland. You are a field commander, leading the era’s most powerful military machines in the campaign to retake America’s cities and suburbs. Superpowered Warfare - Unleash the arsenals of the great military superpowers in the gripping single-player story created by best-selling author and Cold War authority, Larry Bond. MassTech Engine - The latest version of Massive’s proprietary engine allows for a full 360° range of camera control, allowing you to get right down into the midst of battle. Demolish Everything - Destroy every object in the game – crush cars, destroy buildings, burn forests! Drop-in Multiplayer - Join on-going games and immediately help your team take control of the map. [Sierra]", "89"], "Duke Nukem 3D": ["JAN 29, 1996", "Prepare yourself for the ultimate 3D Slugfest. Murderous aliens have landed in futuristic Los Angeles, and the humans suddenly find themselves atop the endangered species list. The odds are a million-to-one. Just the way Duke likes it. Dive into realistic 3D scenarios, with 28 totally realistic levels, as you drive the sinister aliens through the streets of LA, out to an orbiting station, and onto the surface of the moon itself! An you'll be armed to the teeth with 10 hi-tech weapons. Clear crowds with the pump action Assault Shotgun, blast through enemies and walls with the Rocket Propelled Grenade, splat enemies under foot after blasting them with the Shrinker, cut through trouble with the 3-barel Ripper machine gun, set DukeMatch traps with the wall-mounted Laser Mine, watch enemies shatter after cooling them off with the Freeze Cannon, and 4 more! [FormGen]", "89"], "Far Cry": ["MAR 23, 2004", "A tropical paradise seethes with hidden evil in Far Cry, a cunningly detailed action shooter that pushes the boundaries of combat to shocking new levels. Freelance mariner Jack Carver is cursing the day he ever came to this island. A week ago, a brash female reporter named Valerie had offered him an incredible sum of cash to take her to this unspoiled paradise. Shortly after docking, however, Jack's boat was greeted by artillery fire from a mysterious militia group swarming about the island. With his boat destroyed, his money gone, and the gorgeous Valerie suddenly missing, Jack now finds himself facing an army of mercenaries amidst the wilds of the island, with nothing but a gun and his wits to survive. But the further he pushes into the lush jungle canopy, the stranger things become. [Ubi Soft]", "89"], "Lone Echo": ["JUL 20, 2017", "You’re Jack, an advanced cybernetic AI stationed at a mining facility on the rings of Saturn. Alongside Captain Olivia Rhodes, you’ll use your technical ingenuity and futuristic tools to overcome a variety of challenges and obstacles while you investigate a mysterious spatial anomaly.", "89"], "FIFA Soccer 12": ["SEP 27, 2011  • ", "FIFA Soccer 12 brings to the pitch a new game-changing Player Impact Engine, which is a physics engine built to deliver real-world physicality in every interaction on the pitch.", "89"], "Mass Effect 3": ["MAR 6, 2012  • ", "BioWare completes the Mass Effect Trilogy with Mass Effect 3. Earth is burning. Striking from beyond known space, a race of terrifying machines have begun their destruction of the human race. As Commander Shepard, an Alliance Marine, the only hope for saving mankind is to rally the civilizations of the galaxy and launch one final mission to take back the Earth.", "89"], "Rise of Nations": ["MAY 20, 2003", "Dominate 6,000 years of history from the Ancient Age to the Information Age. Which forces will you deploy to lead your nation to global prominence? Trade, espionage, diplomacy?war? Whichever path you choose, you?ll experience the pulse pounding thrill and speed of real-time gaming combined with the epic scope and depth of turn-based strategy games ? brought together for the first time ever in Rise of Nations. Rise of Nations is a new historical real time strategy game from Big Huge Games' Brian Reynolds, designer of PC game classics such as \"Civilization 2\" and \"Alpha Centauri.\" In Rise of Nations, you'll create new cities, improve city infrastructures and expand national borders. Conquer foes through military might using everything from sling-shots to cannons to stealth bombers to nuclear weapons; corner the market on key commodities and consolidate power under your rule; wheel and deal across time with history's eminent cultures. [Microsoft]", "89"], "The Curse of Monkey Island": ["OCT 31, 1997", "Quick - what has dozens of monkeys, ghost pirates galore and more insults than a cranky parrot? Why, The Curse of Monkey Island, of course! In this highly anticipated third installment to LucasArts' popular Monkey Island series of graphic adventures, Guybrush Threepwood once again takes up dull blade and rapier wit against the nefarious demon-pirate LeChuck. In Curse, Guybrush must save his one true love, Elaine Marley, from being turned into the evil pirate's zombie bride. But, hoping to marry Elaine himself, Guybrush unknowingly slips a cursed ring onto her finger that transforms her into a gold statue. He must then find a way to change Elaine back to her beautiful self and stop LeChuck from carrying out his sinister plans. Aye, 'tis a rollicking piratey adventure that's sure to challenge the mind and shiver a few timbers! [LucasArts]", "89"], "Rez Infinite": ["AUG 9, 2017", "To resolve the world's rising crime rates, a new system called Project-K was created. However, Eden, the core of Project-K, has fallen into a vegetative state. Now it's up to you, a hacker, to travel through a cyberspace filled with firewalls, viruses, and other obstacles, and jump-start the system's artificial intelligence. Scattered throughout the levels are evolution spheres, which let you transform into more powerful humanoid forms. The game features a pounding soundtrack and unique vector worlds.", "89"]}